# frozen_string_literal: true

tap 'jesseduffield/lazydocker'
tap 'heroku/brew'

# casks
cask '1password'
cask 'android-studio'
cask 'box-drive'
cask 'cyberduck'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'java'
cask 'jumpcut'
cask 'keepingyouawake'
cask 'licecap'
cask 'minecraft'
cask 'plex'
cask 'postman'
cask 'quicklook-json'
cask 'quicksilver'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'superhuman'
cask 'the-unarchiver'
cask 'vlc'
cask 'whatsapp'
cask 'yujitach-menumeters'

# formulae
brew 'amazon-ecs-cli'
brew 'bat'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'cv'
brew 'dep'
brew 'elasticsearch'
brew 'fd'
brew 'ffmpeg'
brew 'fswatch'
brew 'gnupg'
brew 'go'
brew 'gource'
brew 'gradle'
brew 'grpcurl'
brew 'heroku'
brew 'hr'
brew 'hub'
brew 'hyperfine'
brew 'imagemagick@6', link: true
brew 'irssi'
brew 'jq'
brew 'lazydocker'
brew 'lftp'
brew 'libressl'
brew 'libxml2'
brew 'lua'
brew 'luarocks'
brew 'm-cli'
brew 'macvim', args: ['--override-system-vim']
brew 'mas'
brew 'memcached'
brew 'mercurial'
brew 'mysql@5.7'
brew 'neofetch'
brew 'neovim'
brew 'npm'
brew 'octave', args: ['--with-qt5']
brew 'phantomjs'
brew 'pipenv'
brew 'postgresql'
brew 'pow'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rg'
brew 'ruby-build'
brew 'shellcheck'
brew 'telnet'
brew 'terminal-notifier'
brew 'tfenv'
brew 'tig'
brew 'tldr'
brew 'tmux', args: ['--HEAD']
brew 'tree'
brew 'watchman'
brew 'yarn'
brew 'z'
brew 'zlib'
brew 'zsh'
