# frozen_string_literal: true

# taps
tap 'adoptopenjdk/openjdk'
tap 'drn/homebrew-tap'
tap 'fishtown-analytics/dbt'
tap 'goreleaser/tap'
tap 'heroku/brew'
tap 'jesseduffield/lazydocker'

# casks
cask '1password'
cask '1password-cli'
cask 'adoptopenjdk8'
cask 'alacritty'
cask 'android-studio'
cask 'bartender'
cask 'box-drive'
cask 'cyberduck'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'flycut'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'keepingyouawake'
cask 'keybase'
cask 'licecap'
cask 'notion'
cask 'postman'
cask 'quicklook-json'
cask 'redisinsight'
cask 'rowanj-gitx'
cask 'securid' # Mastercard Connect Utility
cask 'slack'
cask 'spotify'
cask 'superhuman'
cask 'tableplus'
cask 'the-unarchiver'
cask 'vlc'
cask 'vnc-viewer'
cask 'whatsapp'
cask 'yujitach-menumeters'

# formulae
brew 'amazon-ecs-cli'
brew 'apache-spark'
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'blueutil'
brew 'chafa'
brew 'circleci'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'cv'
brew 'dbt'
brew 'dep'
brew 'elasticsearch'
brew 'fd'
brew 'ffmpeg'
brew 'fswatch'
brew 'git-gui'
brew 'git-lfs'
brew 'gnupg'
brew 'go'
brew 'goreleaser'
brew 'gource'
brew 'gradle'
brew 'grpcurl'
brew 'heroku'
brew 'hr'
brew 'hub'
brew 'hyperfine'
brew 'imagemagick@6', link: true
brew 'jq'
brew 'lazydocker'
brew 'lftp'
brew 'libressl'
brew 'libxml2'
brew 'loc'
brew 'lua'
brew 'luarocks'
brew 'm-cli'
brew 'mas'
brew 'memcached'
brew 'mercurial'
brew 'mysql@5.7'
brew 'neofetch'
brew 'neovim'
brew 'nerd-ls'
brew 'npm'
brew 'phantomjs'
brew 'pipenv'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rg'
brew 'ruby-build'
brew 'scala'
brew 'shellcheck'
brew 'telnet'
brew 'terminal-notifier'
brew 'tfenv'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'wakeonlan'
brew 'watchman'
brew 'yarn'
brew 'zlib'
brew 'zoxide'
brew 'zsh'
