# frozen_string_literal: true

# taps
tap 'adoptopenjdk/openjdk'
tap 'drn/homebrew-tap'
tap 'ethereum/ethereum'
tap 'goreleaser/tap'
tap 'homebrew/cask-drivers'
tap 'puma/puma'

# casks
cask '1password'
cask '1password-cli'
cask 'adoptopenjdk8'
cask 'alacritty'
cask 'avifquicklook' # Finder QuickLook support for .avif files
cask 'brave-browser'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'flycut'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'hammerspoon'
cask 'keepingyouawake'
cask 'licecap'
cask 'loom'
cask 'notion'
cask 'postman'
cask 'qlvideo'
cask 'quicklook-json'
cask 'rowanj-gitx'
cask 'securid' # Mastercard Connect Utility
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'superhuman'
cask 'tableplus'
cask 'the-unarchiver'
cask 'timemachineeditor'
cask 'vlc'

# formulae
brew 'amazon-ecs-cli'
brew 'asdf'
brew 'atuin'
brew 'awscli'
brew 'bat'
brew 'blueutil'
brew 'chafa'
brew 'circleci'
brew 'cloc'
brew 'cmake'
brew 'code-minimap'
brew 'coreutils'
brew 'croc'
brew 'elasticsearch@6'
brew 'fd'
brew 'ffmpeg'
brew 'fswatch'
brew 'fx' # Terminal JSON viewer
brew 'git-gui'
brew 'git-lfs'
brew 'gnupg'
brew 'goreleaser'
brew 'gource'
brew 'gradle'
brew 'grpcurl'
brew 'hr'
brew 'hyperfine'
brew 'imagemagick@6', link: true
brew 'jq'
brew 'lazydocker'
brew 'lftp'
brew 'libxml2'
brew 'loc'
brew 'lua'
brew 'luarocks'
brew 'm-cli'
brew 'mas'
brew 'memcached'
brew 'mysql@5.7'
brew 'neofetch'
brew 'neovim'
brew 'nerd-ls'
brew 'npm'
brew 'openssl@1.1'
brew 'postgresql'
brew 'progress'
brew 'puma-dev'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rg'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'solidity'
brew 'spotify-tui'
brew 'telnet'
brew 'terminal-notifier'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'wakeonlan'
brew 'watchman'
brew 'yarn'
brew 'zlib'
brew 'zoxide'
brew 'zsh'
