# frozen_string_literal: true

# casks
cask '1password'
cask 'android-studio'
cask 'caffeine'
cask 'cyberduck'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'java'
cask 'jumpcut'
cask 'licecap'
cask 'mailplane'
cask 'postman'
cask 'quicksilver'
cask 'realm-browser'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'superhuman'
cask 'the-unarchiver'
cask 'vlc'
cask 'whatsapp'
cask 'yujitach-menumeters'
cask 'zeplin'

# formulae
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'cv'
brew 'elasticsearch'
brew 'fd'
brew 'ffmpeg'
brew 'fswatch'
brew 'go'
brew 'gource'
brew 'gradle'
brew 'heroku-toolbelt'
brew 'hr'
brew 'hub'
brew 'imagemagick@6', link: true
brew 'irssi'
brew 'jq'
brew 'lua'
brew 'm-cli'
brew 'macvim', args: ['--override-system-vim']
brew 'mas'
brew 'memcached'
brew 'mercurial'
brew 'mysql@5.6'
brew 'neofetch'
brew 'neovim'
brew 'npm'
brew 'openssl'
brew 'phantomjs'
brew 'postgresql'
brew 'pow'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rg'
brew 'ruby-build'
brew 'telnet'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux', args: ['--HEAD']
brew 'tree'
brew 'yarn'
brew 'z'
brew 'zsh'
